{
  "architectures": [
    "WeatherModel"
  ],
  "dtype": "float32",
  "kernel_size": [
    3,
    3
  ],
  "mean": [
    256.040771484375,
    256.1037902832031,
    255.8612060546875,
    262.1660461425781,
    261.9051208496094,
    261.5450134277344,
    255.7640380859375,
    256.07958984375,
    255.78875732421875,
    255.96844482421875,
    256.1410827636719,
    256.1825256347656,
    256.1313781738281,
    256.1244201660156,
    255.88311767578125,
    255.8798370361328
  ],
  "model_type": "weather",
  "num_hidden1": 64,
  "num_hidden2": 128,
  "num_inputs": 16,
  "num_outputs": 2,
  "std": [
    36.39994812011719,
    36.50407791137695,
    36.15944290161133,
    38.14473342895508,
    37.89503860473633,
    38.01960372924805,
    36.0755500793457,
    35.924774169921875,
    35.59754943847656,
    36.34516906738281,
    36.42196273803711,
    36.36506652832031,
    36.32616424560547,
    36.33544158935547,
    36.0845832824707,
    36.29605484008789
  ],
  "transformers_version": "5.5.4"
}
